app/controllers/card_controller.rb

  def new
    @card = Card.new
    @list = List.find_by(id: params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @card = Card.new(card_params)
    if @card.save
---
INSERT INTO "cards" ("title", "memo", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "123"], ["memo", "222"], ["list_id", 2], ["created_at", "2020-01-24 14:27:47.635818"], ["updated_at", "2020-01-24 14:27:47.635818"]]

  def edit
    # @card = Card.find_by(id: params[:id])
    @lists = List.where(user: current_user)
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [["user_id", 1]]

  def update
    # @card = Card.find_by(id: params[:id])
    if @card.update_attributes(card_params)
---
UPDATE "cards" SET "list_id" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["list_id", 3], ["updated_at", "2020-01-24 14:31:48.465670"], ["id", 2]]

  def destroy
    @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 2]]

    def set_card
      @card = Card.find_by(id: params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]