app/controllers/list_controller.rb

INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リスト２"], ["user_id", 1], ["created_at", "2020-01-24 12:41:54.408418"], ["updated_at", "2020-01-24 12:41:54.408418"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "リスト１-2"], ["updated_at", "2020-01-24 12:38:01.492830"], ["id", 1]]
---
  def update
    # @list = List.find_by(id: params[:id])
    if @list.update_attributes(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_list
      @list = List.find_by(id: params[:id])